app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "I knew it man"], ["message_id", 8], ["user_id", 3], ["created_at", "2019-08-31 20:29:15.130135"], ["updated_at", "2019-08-31 20:29:15.130135"]]
INSERT INTO "comments" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "I can help you with that"], ["message_id", 8], ["user_id", 4], ["created_at", "2019-09-01 21:38:59.679655"], ["updated_at", "2019-09-01 21:38:59.679655"]]
---
    def create
        @comment = @message.comments.create(comment_params)
        @comment.user_id = current_user.id

        if @comment.save