app/controllers/messages_controller.rb

    def create
        @message = current_user.messages.build(message_params)
        if @message.save
---
INSERT INTO "messages" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "WOWWW"], ["description", "ITS a Scam"], ["created_at", "2019-09-01 22:29:03.835587"], ["updated_at", "2019-09-01 22:29:03.835587"], ["user_id", 5]]

    def update
        if @message.update(message_params)
---
UPDATE "messages" SET "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["description", "NA BHAI NA NA NA ANA"], ["updated_at", "2019-08-30 18:56:30.458840"], ["id", 4]]